tutorials/CFD/mydeim(5s withdt=0.001)/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;
//EigenSolver spectra;

// Number of modes to output and to use for projection
//NmodesUout 50;
NmodesUproj 10;
//NmodePUout 50;
NmodesPproj 10;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

bcMethod penalty;//penalty
warning false;

debug 1;

// // Inlet boundary conditions velocities.
 online_velocities vel.txt;

NmodesU  10;
NmodesP  10;
NmodesS  30;
